<a href="https://colab.research.google.com/github/Ist210group10/Group-Lab-1/blob/master/Group_Assignment_4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
from IPython.display import SVG
SVG(filename = 'desktop/GroupAssignment4.svg')

In [0]:
import sqlite3 # Once imported in a single notebook, it is available to us throughout the rest of the notebook. 
# connect to database, if not there, create it.
connectionToDatabase = sqlite3.connect('FlightData') 

cursor = connectionToDatabase.cursor()
cursor.execute('''drop table IF EXISTS Flight''')
connectionToDatabase.commit()

cursor.execute('''create table IF NOT EXISTS Flight (FlightID text PRIMARY KEY, PilotID int, FlightTime int, FlightDistance int, NumberOfPassengers int)''')
connectionToDatabase.commit()

cursor = connectionToDatabase.cursor()
cursor.execute('''drop table IF EXISTS Passenger''')
connectionToDatabase.commit()

cursor.execute('''create table IF NOT EXISTS Passenger (PassengerID text PRIMARY KEY, FlightID int, FName text, LName text)''')
connectionToDatabase.commit()

cursor = connectionToDatabase.cursor()
cursor.execute('''drop table IF EXISTS Airplane''')
connectionToDatabase.commit()

cursor.execute('''create table IF NOT EXISTS Airplane (AirplaneID int PRIMARY KEY, PilotID int, Model text, Rent int, GasTankSize int) ''')
connectionToDatabase.commit()

cursor = connectionToDatabase.cursor()
cursor.execute('''drop table IF EXISTS Pilot''')
connectionToDatabase.commit()

cursor.execute('''create table IF NOT EXISTS Pilot (PilotID int PRIMARY KEY, time int, distance int, cost int) ''')
connectionToDatabase.commit()


cursor = connectionToDatabase.cursor()
cursor.execute('''drop table IF EXISTS Cost''')
connectionToDatabase.commit()

cursor.execute('''create table IF NOT EXISTS Cost (CostID int PRIMARY KEY, AirplaneID int, fuel int, rent int, instructor text) ''')
connectionToDatabase.commit()

* Flight time: hours, flight distance: miles
* Gas tank size: gallons, rent: dollars per hour
* Time: hours flown, Distance: total miles flown, cost: total cost
* Pilot cost: total cost affilated
*CostID: fuel: cost of flight, rent total

In [0]:
cursor.execute('''insert into Flight values ('020101', '123456', '2', '500', '3');''')
connectionToDatabase.commit()
cursor.execute('''insert into Flight values ('020102', '112345', '5', '1100', '5');''')
connectionToDatabase.commit()
cursor.execute('''insert into Flight values ('020103', '122345', '9', '2500', '10');''')
connectionToDatabase.commit()
cursor.execute('''insert into Flight values ('020104', '123345', '1', '200', '1');''')
connectionToDatabase.commit()
cursor.execute('''insert into Flight values ('020105', '124453', '10', '2700', '5');''')
connectionToDatabase.commit()

cursor.execute('''insert into Passenger values ('020108', '020101', 'Susan', 'Jones');''')
connectionToDatabase.commit()
cursor.execute('''insert into Passenger values ('020109', '020102', 'Mike', 'Wazowski');''')
connectionToDatabase.commit()
cursor.execute('''insert into Passenger values ('020100', '020103', 'Trace', 'McSorely');''')
connectionToDatabase.commit()
cursor.execute('''insert into Passenger values ('020101', '020104', 'James', 'Connor');''')
connectionToDatabase.commit()
cursor.execute('''insert into Passenger values ('020102', '020105', 'Joe', 'Jonas');''')
connectionToDatabase.commit()

cursor.execute('''insert into Airplane values ('05678', '123456', 'Cessna 152', '75', '50');''')
connectionToDatabase.commit()
cursor.execute('''insert into Airplane values ('05679', '112345', 'Cessna 150', '70', '100');''')
connectionToDatabase.commit()
cursor.execute('''insert into Airplane values ('05680', '122345', 'Cessna 152', '75', '50');''')
connectionToDatabase.commit()
cursor.execute('''insert into Airplane values ('05681', '123345', 'Cessna 152', '75', '50');''')
connectionToDatabase.commit()
cursor.execute('''insert into Airplane values ('05682', '124453', 'Cessna 150', '70', '100');''')
connectionToDatabase.commit()

cursor.execute('''insert into Pilot values ('123456', '27', '1578', '2025');''')
connectionToDatabase.commit()
cursor.execute('''insert into Pilot values ('112345', '50', '3000', '5500');''')
connectionToDatabase.commit()
cursor.execute('''insert into Pilot values ('122345', '65', '3500', '6300');''')
connectionToDatabase.commit()
cursor.execute('''insert into Pilot values ('123345', '10', '800', '750');''')
connectionToDatabase.commit()
cursor.execute('''insert into Pilot values ('124453', '24', '1200', '1850');''')
connectionToDatabase.commit()

cursor.execute('''insert into Cost values ('03', '05678', '130', '2025', 'Miles Sanders');''')
connectionToDatabase.commit()
cursor.execute('''insert into Cost values ('04', '05679', '550', '5500', 'Juju Smith-Shuster');''')
connectionToDatabase.commit()
cursor.execute('''insert into Cost values ('05', '05680', '780', '6300', 'Jim Berry');''')
connectionToDatabase.commit()
cursor.execute('''insert into Cost values ('06', '05681', '100', '750', 'Zac Efron');''')
connectionToDatabase.commit()
cursor.execute('''insert into Cost values ('07', '05682', '230', '1850', 'Kim Kardash');''')
connectionToDatabase.commit()

In [0]:
cursor.execute('''select * FROM Flight''')
for row in cursor.fetchall():
  print(row)

('020101', 123456, 2, 500, 3)
('020102', 112345, 5, 1100, 5)
('020103', 122345, 9, 2500, 10)
('020104', 123345, 1, 200, 1)
('020105', 124453, 10, 2700, 5)

In [0]:
cursor.execute('''select * FROM Passenger''')
for row in cursor.fetchall():
  print(row)

('020108', 20101, 'Susan', 'Jones')
('020109', 20102, 'Mike', 'Wazowski')
('020100', 20103, 'Trace', 'McSorely')
('020101', 20104, 'James', 'Connor')
('020102', 20105, 'Joe', 'Jonas')

In [0]:
cursor.execute('''select * FROM Airplane''')
for row in cursor.fetchall():
  print(row)

(5678, 123456, 'Cessna 152', 75, 50)
(5679, 112345, 'Cessna 150', 70, 100)
(5680, 122345, 'Cessna 152', 75, 50)
(5681, 123345, 'Cessna 152', 75, 50)
(5682, 124453, 'Cessna 150', 70, 100)

In [0]:
cursor.execute('''select * FROM Pilot''')
for row in cursor.fetchall():
  print(row)

(123456, 27, 1578, 2025)
(112345, 50, 3000, 5500)
(122345, 65, 3500, 6300)
(123345, 10, 800, 750)
(124453, 24, 1200, 1850)

In [0]:
cursor.execute('''select * FROM Cost''')
for row in cursor.fetchall():
  print(row)

(3, 5678, 130, 2025, 'Miles Sanders')
(4, 5679, 550, 5500, 'Juju Smith-Shuster')
(5, 5680, 780, 6300, 'Jim Berry')
(6, 5681, 100, 750, 'Zac Efron')
(7, 5682, 230, 1850, 'Kim Kardash')

**How much money was spent on training by the students?**

In [0]:
cursor.execute('''select AVG(rent+fuel) FROM Cost''')
for row in cursor.fetchall():
  print(row)

(3643.0,)

This question was asked because it is the main reason the database was created. It helps to keep track of the total spend on training by a group. It is easy for students to loose track of how muhc they are spending when they rent an aircraft and go for a flight but knowing this will help them understand the costs associated with flight.

**How far did the students fly on average?**

In [0]:
cursor.execute('''select AVG(flightdistance) FROM Flight ''')
for row in cursor.fetchall():
  print(row)

(1400.0,)

This question is so that students can know approximately how far they will fly during a lesson. This is so that students can mental prepare themselves for longer flights but also know how much fuel to put into aircraft as well as plan for routes that are about this distance.

**Which airplanes were used to train pilots?**

In [0]:
cursor.execute('''select model FROM airplane group by model''')
for row in cursor.fetchall():
  print(row)

('Cessna 150',)
('Cessna 152',)

This question was asked for two reasons. This information is useful for instructors so they can see what planes are being used for training and focus their lessons around the instrumentation of those planes. It is also helpful for the students so they can become familiar with the layout and performance of the planes to perform better in their lessons.